{
  "name": "Alteacare",
  "description": {
    "work": [
      "Alteacare is an application for meet with doctor, shop medicine, consultation with doctor, and etc"
    ],
    "about": [
      "AlteaCare is an integrated and most complete health application in Indonesia.",
      "Standing under the auspices of PT. Sehat Digital Nusantara, AlteaCare offers a variety of health services, from teleconsultation via video calls with specialist doctors, buying and sending prescriptions, vaccination registration, to the latest health information."
    ]
  },
  "objective": [
    "Developed microservices-based architectures, designing and building modular systems to achieve scalability, flexibility, and maintainability.",
    "Utilized Redis cache for efficient data caching and improved performance, optimizing response times in applications.",
    "Worked with Docker containers to create portable and isolated environments for seamless deployment and scalability.",
    "Developed applications using PostgreSQL and MongoDB, ensuring reliable data storage and retrieval for different use cases.",
    "Leveraged Node.js and Express (Node.js framework) to build robust and high-performance back-end solutions.",
    "Developed GRPC-based microservice gateways, enabling seamless communication and integration between microservices.",
    "Implemented ESLint with Airbnb code style, ensuring consistent and clean code across the codebase.",
    "Utilized Clean Architecture principles to design scalable, testable, and maintainable applications.",
    "Developed front-end applications using React and Next.js, leveraging their powerful features and performance optimization.",
    "Implemented Atomic Architecture for front-end development, promoting component reusability and maintainability.",
    "Utilized Tailwind CSS for efficient and responsive UI development, achieving streamlined and visually appealing designs.",
    "Employed Redux for state management, enabling predictable and efficient data flow in front-end applications.",
    "Integrated with payment gateway (Midtrans.com), enabling secure and reliable payment processing for e-commerce applications.",
    "Integrated with Socket.IO for real-time bidirectional communication in web applications, enabling features such as chat or notifications.",
    "Integrated with Strapi (strapi.io), a headless CMS, to streamline content management and delivery.",
    "Integrated with Twilio (twilio.com) for video web RTC capabilities, enabling real-time video communication similar to Google Meet.",
    "Utilized MoEngage (moengage.com) for push notification services, enabling personalized and targeted notifications.",
    "Successfully integrated applications with Vercel for seamless deployment and hosting.",
    "Experienced in working with GitHub for version control and collaborative development.",
    "Proficient in working within an Agile ecosystem, utilizing Agile methodologies and tools for efficient project management.",
    "Experienced in using Jira for task tracking, issue management, and project planning.",
    "Developed unit tests for both front-end and back-end components, ensuring code quality, reliability, and maintainability."
  ],
  "timeline": [
    {
      "title": "March 2021",
      "content": "Create API for appointment"
    },
    {
      "title": "April 2021",
      "content": "Help frontend dev to develop Doctor CMS"
    },
    {
      "title": "May 2021",
      "content": "Integrate Twilio WEB-RTC to create appointment with video call with doctor"
    },
    {
      "title": "June 2021",
      "content": "Assigned to frontend dev, Develop Marketing CMS"
    },
    {
      "title": "July 2021",
      "content": "Rewrite Existing Doctor CMS to get readable code"
    },
    {
      "title": "August 2021",
      "content": "Help Backend to develop master data API"
    },
    {
      "title": "September 2021",
      "content": "Integrate master data API in frontend"
    },
    {
      "title": "October 2021",
      "content": "Integrate Voucher API in frontend"
    },
    {
      "title": "November 2021",
      "content": "Renew Frontend Architecture"
    },
    {
      "title": "December 2021",
      "content": "Creating Unit Test (Frontend)"
    },
    {
      "title": "January 2022",
      "content": "Bugfix about doctor video call page"
    },
    {
      "title": "February 2022",
      "content": "Develop API Ecommerce"
    },
    {
      "title": "March 2022",
      "content": "Integrate with another service in Ecommerce API"
    },
    {
      "title": "April 2022",
      "content": "Develop API Ecommerce"
    },
    {
      "title": "May 2022",
      "content": "Integrate Ecommerce API in frontend"
    },
    {
      "title": "June 2022",
      "content": "Integrate Ecommerce API in frontend"
    },
    {
      "title": "July 2022",
      "content": "Integrate Ecommerce API in frontend"
    },
    {
      "title": "August 2022",
      "content": "Speed and performance review"
    },
    {
      "title": "September 2022",
      "content": "Creating unit test (Frontend)"
    },
    {
      "title": "October 2022",
      "content": "Creating unit test (Frontend)"
    },
    {
      "title": "November 2022",
      "content": "Integrate SAP system (Hospital System)"
    },
    {
      "title": "December 2022",
      "content": "Integrate SAP system (Hospital system)"
    },
    {
      "title": "January 2023",
      "content": "Resign"
    }
  ],
  "stacks": [
    {
      "type": "NODEJS",
      "percentage": "100"
    },
    {
      "type": "REACTJS",
      "percentage": "100"
    },
    {
      "type": "NEXTJS",
      "percentage": "100"
    },
    {
      "type": "REDUX",
      "percentage": "100"
    },
    {
      "type": "DOCKER",
      "percentage": "100"
    },
    {
      "type": "POSTGRESQL",
      "percentage": "100"
    },
    {
      "type": "MONGODB",
      "percentage": "100"
    },
    {
      "type": "TAILWIND",
      "percentage": "100"
    }
  ]
}