{
  "name": "BPPT (BADAN PENGKAJIAN DAN PENERAPAN TEKNOLOGI)",
  "description": {
    "work": [
      "BPPT is technology researcher for government",
      "The system that I built is CMS for managing employee"
    ],
    "about": [
      "BPPT is a Non-Ministerial Government Institution under the coordination of the National Research and Innovation Agency which is directly responsible to the President in carrying out governmental tasks in the field of technology assessment and application."
    ]
  },
  "objective": [
    "Utilize Laravel framework for efficient and scalable application development, leveraging its robust features and ecosystem.",
    "Incorporate Vue.js as the frontend framework to build a responsive and interactive user interface for seamless employee management.",
    "Utilize MySQL as the database management system to store and retrieve employee-related data securely and efficiently.",
    "Implement Redis cache to enhance performance by caching frequently accessed data and reducing database queries.",
    "Create comprehensive API documentation using Postman to provide clear guidelines and examples for developers to interact with the application's APIs.",
    "Integrate with Gmail as the email sender service to facilitate seamless communication and notifications within the employee management system.",
    "Establish integration with a government system to ensure compliance with legal requirements, such as employee data reporting or tax-related processes.",
    "Develop features for employee onboarding, offboarding, and profile management, allowing efficient handling of employee data and documentation.",
    "Implement authentication and authorization mechanisms to ensure secure access and protect sensitive employee information.",
    "Build modules for leave management, attendance tracking, and performance evaluation to streamline employee-related processes.",
    "Enable document management functionality to securely store and manage employee-related files, such as contracts, resumes, or performance records.",
    "Implement notifications and reminders for important events, such as birthdays, anniversaries, or upcoming deadlines, to improve employee engagement and communication.",
    "Develop reporting and analytics features to generate insights and metrics related to employee performance, attendance, or other relevant metrics.",
    "Continuously test, debug, and maintain the application to ensure it remains efficient, secure, and aligned with evolving business requirements and regulations."
  ],
  "timeline": [
    {
      "title": "December 2020",
      "content": "Gathering requirement, Adjust admin template, create basic API (Create, Read, Update, and Delete)"
    },
    {
      "title": "January 2021",
      "content": "Connect API, UAT, Project done"
    }
  ],
  "stacks": [
    {
      "type": "LARAVEL",
      "percentage": "40"
    },
    {
      "type": "VUEJS",
      "percentage": "50"
    },
    {
      "type": "BOOTSTRAP",
      "percentage": "10"
    },
    {
      "type": "NGINX",
      "percentage": "100"
    },
    {
      "type": "MYSQL",
      "percentage": "100"
    }
  ]
}