{
  "name": "Ecocare",
  "description": {
    "work": [
      "Ecocare is hygiene service and has cooperate with many companies",
      "The system that I maintaned is CMS (Content Management System) of Ecocare. Ecocare have CMS for managing Inventory, Branch, Contract In/Out, Scheduling"
    ],
    "about": [
      "PT Indocare Pacific begins its journey in the support services field especially on the Hygiene Service for washrooms. From its debut, this company have been supported by founders and operational staff with 25 years of experiences in this field. That is the reason of ecoCare draws a big attention from manufacturers who cares for their company’s hygiene and cleanliness.",
      "With the strong commitment in eco- friendly and health-concious Hygiene service, ecoCare imposes innovative products that limit the use of chemicals and revolutionize it with natural substances.",
      "This is the attitude and company’s core business towards the world’s high demand to create a safer environment and make a better future for humankind."
    ]
  },
  "objective": [
    "Developed an inventory management application using Codeigneter 3 and mySQL, resulting in a robust and user-friendly system that improved inventory tracking and management",
    "Successfully maintained existing features of the application, ensuring system stability and uninterrupted business operations",
    "Conducted thorough analysis of business requirements and developed several new features, such as scheduling, Contract Management, and Stock Reporting",
    "Collaborated with cross-functional teams, including business analysts and end-users, to ensure new features were aligned with business goals and user needs",
    "Conducted rigorous testing and debugging to ensure new features were error-free and functioned as intended",
    "Demonstrated proficiency in Laravel and mySQL, using best practices to develop and maintain a high-quality, scalable, and secure application",
    "Provided ongoing technical support and training to end-users, ensuring they were able to effectively utilize the application's features to manage inventory and improve business processes"
  ],
  "timeline": [
    {
      "title": "Auugust 2018",
      "content": "Assigned project to maintenance, built new feature, improve query and speed of load time, Learn the existing system about code and flow"
    },
    {
      "title": "August 2018",
      "content": "Fix several bug from list of end user feedback, clean the unreadable code, implement new flow"
    },
    {
      "title": "September 2018",
      "content": "Built new feature such as auto scheduling feature for clean and service of ecoccare"
    },
    {
      "title": "October 2018",
      "content": "Solving issue of stock reporting, product module flow, contract flow and several bug"
    },
    {
      "title": "November 2018",
      "content": "Improve performance database query, improve code become readable code"
    },
    {
      "title": "December 2018",
      "content": "Improve website loadtime and server memory usage"
    },
    {
      "title": "January 2019",
      "content": "Built auto renew contract feature, teach how to use the new feature"
    },
    {
      "title": "February 2019",
      "content": "Monitoring Website and project closed"
    }
  ],
  "stacks": [
    {
      "type": "CODEIGNETER",
      "percentage": "60"
    },
    {
      "type": "PHP",
      "percentage": "5"
    },
    {
      "type": "BOOTSTRAP",
      "percentage": "15"
    },
    {
      "type": "JQUERY",
      "percentage": "20"
    },
    {
      "type": "MYSQL",
      "percentage": "100"
    },
    {
      "type": "NGINX",
      "percentage": "100"
    }
  ]
}