{
  "name": "GOTOKO",
  "description": {
    "work": [
      "GOTOKO is an end-to-end e-B2B digital platform connecting brands with underserved retailers (warungs) all over Indonesia",
      "The system that I built is Marketing CMS, Retail CMS, and Product CMS"
    ],
    "about": [
      "GOTOKO and the Guardians are driven by creating the best experience for the underserved warungs and we stay true to our mission of being the platform of choice for the warungs by providing relevant assortment at competitive prices with guaranteed time-bound delivery."
    ]
  },
  "objective": [
    "Developed applications using Next.js, leveraging its server-side rendering capabilities and optimized performance for seamless user experiences.",
    "Utilized Redux Observable for state management, effectively handling complex data flows and enabling reactive and efficient updates.",
    "Created marketing dashboard admin, providing comprehensive analytics and tools for effective marketing campaign management.",
    "Developed product dashboard admin, empowering businesses to efficiently manage and track their product inventory, pricing, and information.",
    "Created sales dashboard admin, providing real-time insights into sales performance, customer data, and revenue metrics.",
    "Implemented data visualization techniques to present key metrics and trends in an intuitive and visually appealing manner.",
    "Collaborated closely with stakeholders to gather requirements, understand business needs, and deliver dashboard solutions that exceeded expectations.",
    "Implemented responsive designs and intuitive user interfaces to enhance usability and user satisfaction.",
    "Utilized best practices in UI/UX design to create visually appealing and user-friendly dashboard interfaces.",
    "Conducted thorough testing and debugging to ensure the functionality and reliability of the dashboard admin applications."
  ],
  "timeline": [
    {
      "title": "April 2021",
      "content": "Explaining about existing system, Learn about the code"
    },
    {
      "title": "May 2021",
      "content": "Layouting component for new page, Connect API, Testing"
    },
    {
      "title": "June 2021",
      "content": "Layouting new CMS (Sales CMS) and Integrate API"
    },
    {
      "title": "July 2021",
      "content": "Layouting new CMS (Marketing CMS) and Integrate API "
    },
    {
      "title": "August 2021",
      "content": "Testing, UAT, Deployment"
    }
  ],
  "stacks": [
    {
      "type": "NEXTJS",
      "percentage": "80"
    },
    {
      "type": "DOCKER",
      "percentage": "5"
    },
    {
      "type": "REDUX",
      "percentage": "10"
    },
    {
      "type": "MATERIALUI",
      "percentage": "5"
    }
  ]
}