{
  "name": "Jati Tinggi Holding",
  "description": {
    "work": [
      "Jati Tinggi Holding is construction of power cable manhole and ducting systems, substations, power cable erection and energization, street lighting and Fiber Optic cable implementation for the main telecommunication services providers in Malaysia",
      "The system that I maintained is CMS, Jati Tinggi Holding have core system Managing Material, Managing Contract, Managing In/Out of purchase"
    ],
    "about": [
      "Jati Tinggi Holding construction of power cable manhole and ducting systems, substations, power cable erection and energization, street lighting"
    ]
  },
  "objective": [
    "Developed applications using Laravel, leveraging its powerful features and elegant syntax for efficient web development.",
    "Utilized MySQL for database management, ensuring secure and reliable data storage and retrieval.",
    "Successfully maintained existing features, performing updates, bug fixes, and optimizations to ensure smooth operation.",
    "Created stock management system with automatic stock price updates, enabling efficient inventory management and pricing accuracy.",
    "Developed budget management functionality for project purposes, enabling effective tracking and control of project expenses.",
    "Implemented a scheduler for invoice notices, automating the process of sending timely reminders to clients for payment.",
    "Developed an application integrated with SAP system for property vendor management, facilitating seamless data exchange and streamlining processes.",
    "Conducted thorough testing and quality assurance to ensure the functionality, performance, and security of the applications.",
    "Collaborated closely with stakeholders to gather requirements, understand business needs, and deliver solutions that met their expectations.",
    "Employed best practices in software development, including version control, code documentation, and adhering to coding standards."
  ],
  "timeline": [
    {
      "title": "August 2021",
      "content": "Meeting about existing system, learn the code and flow, bugfix for some page and flow"
    },
    {
      "title": "September 2021",
      "content": "Renew version of package installed, create scheduler feature, project closed"
    }
  ],
  "stacks": [
    {
      "type": "LARAVEL",
      "percentage": "70"
    },
    {
      "type": "JQUERY",
      "percentage": "5"
    },
    {
      "type": "BOOTSTRAP",
      "percentage": "5"
    },
    {
      "type": "MYSQL",
      "percentage": "20"
    },
    {
      "type": "NGINX",
      "percentage": "100"
    }
  ]
}