{
  "name": "PENAkita",
  "description": {
    "work": [
      "PENAkita is platform for get content writer and/or for find freelance to content writer job",
      "The system that I built is Rest API, PENAkita have core system Managing Project, Project Bid (CMS Writer), Managing Bid, Project (CMS Company), Managing Credit, User (CMS Admin)"
    ],
    "about": [
      "PENAkita is a platform that will bring content creators together with brands."
    ]
  },
  "objective": [
    "Developed applications using Node.js and Express, leveraging the lightweight and efficient nature of Node.js for scalable back-end solutions.",
    "Utilized Docker containers for creating portable and isolated environments, enabling seamless deployment and scalability.",
    "Implemented microservices architecture, designing and building modular systems for improved scalability and flexibility.",
    "Utilized PostgreSQL for robust and reliable data storage and retrieval, ensuring data integrity and efficient querying.",
    "Implemented Redis cache for optimizing performance and improving response times in the applications.",
    "Created APIs for the primary website, enabling seamless integration with front-end applications and facilitating data exchange.",
    "Developed APIs for the writer website, providing functionality for content creation, management, and collaboration.",
    "Created APIs for the admin website, enabling administrators to manage users, permissions, and system configurations.",
    "Developed APIs for the content writer hunter, facilitating data retrieval, filtering, and searching for relevant content writers.",
    "Conducted thorough testing and documentation of APIs, ensuring their reliability, security, and ease of integration.",
    "Collaborated closely with cross-functional teams, including front-end developers and designers, to ensure seamless integration and efficient communication.",
    "Followed best practices in API development, including versioning, authentication, and documentation."
  ],
  "timeline": [
    {
      "title": "September 2021",
      "content": "Meeting for gathering requirement, Creating API for Admin CMS"
    },
    {
      "title": "October 2021",
      "content": "Creating API for company CMS"
    },
    {
      "title": "November 2021",
      "content": "Creating API for writer CMS"
    }
  ],
  "stacks": [
    {
      "type": "NODEJS",
      "percentage": "80"
    },
    {
      "type": "DOCKER",
      "percentage": "20"
    },
    {
      "type": "POSTGRESQL",
      "percentage": "100"
    },
    {
      "type": "NGINX",
      "percentage": "100"
    }
  ]
}