{
  "name": "Pesonalokal",
  "description": {
    "work": [
      "Pesonalokal is market place application for sell trip from any travel agent. Pesonalokal also transformation system from PT. Lapaktrip Indonesia known as Lapaktrip (https://lapaktrip.com)",
      "The system that I built is Restfull API. Pesonalokal have core system Managing trip and travel agent, Find best trip, Group trip, PPOB, and more about Trip & Travel System"
    ],
    "about": []
  },
  "objective": [
    "Expertise in developing high-performance web applications using Laravel and Lumen frameworks, with a strong focus on microservices architecture and seamless integration with payment services like NicePay",
    "Skilled in designing and implementing microservices using Lumen and Laravel frameworks, with experience in integrating payment services like NicePay and PPOB for secure and reliable payment processing.",
    "Proficient in developing and deploying scalable applications using Docker and MariaDB, with a strong understanding of payment integration protocols like NicePay and PPOB for seamless payment processing.",
    "Developed advanced travel applications for travel agents, leveraging innovative technologies to seamlessly integrate payment services like NicePay and PPOB for fast and secure payment processing.",
    "Successfully integrated payment services like NicePay and PPOB into travel applications, ensuring smooth payment processing and high customer satisfaction."
  ],
  "timeline": [
    {
      "title": "January 2019",
      "content": "Discuss about renew system version, Migrating database into microservice"
    },
    {
      "title": "February 2019",
      "content": "Move logic to new architecture (microservice architecture), Renew package version"
    },
    {
      "title": "March 2019",
      "content": "Cleaning dirty code, logic, and package, Optimize database query"
    },
    {
      "title": "April 2019",
      "content": "Integrate payment service (Nicepay), Integrate PPOB service"
    },
    {
      "title": "May 2019",
      "content": "Publishing application (phase 1)"
    },
    {
      "title": "June 2019",
      "content": "Adapt to the needs of the mobile app API"
    },
    {
      "title": "July 2019",
      "content": "Optimize database query"
    },
    {
      "title": "August 2019",
      "content": "Optimize microservice communication between service"
    },
    {
      "title": "September 2019",
      "content": "Develop new feature (Group Trip)"
    },
    {
      "title": "October 2019",
      "content": "UAT and Publish application (phase 2)"
    },
    {
      "title": "November 2019",
      "content": "Develop new feature (Multiple purchase PPOB and travel package)"
    },
    {
      "title": "Desember 2019",
      "content": "UAT and Publish application (phase 3)"
    },
    {
      "title": "January 2020",
      "content": "Project closed - Because pandemic"
    }
  ],
  "stacks": [
    {
      "type": "LARAVEL",
      "percentage": "80"
    },
    {
      "type": "PHP",
      "percentage": "20"
    },
    {
      "type": "MARIADB",
      "percentage": "100"
    },
    {
      "type": "NGINX",
      "percentage": "50"
    }
  ]
}