{
  "name": "Privilegez",
  "description": {
    "work": [
      "Privilegez is point system such as `Ponta Point` and integrated with citytours.sg",
      "The system that I built is CMS (Content Management System) of Privilegez and Restfull API. Privilegez have core system Managing User, Coupon, Discount, Point, and Campigns"
    ],
    "about": []
  },
  "objective": [
    "Development with Laravel, utilizing the PHP framework to build robust and scalable web applications with elegant syntax and streamlined workflows.",
    "Development with microservices, allowing for the creation of distributed systems that are highly scalable, flexible, and easily maintainable.",
    "Development with MySQL, leveraging the database management system to build dynamic and responsive applications that effectively store and manage large amounts of data.",
    "Integration with Citytour (https://citytours.sg/), allowing for enhanced tourism-related functionality in web applications, such as booking and reservations for tours and travel.",
    "Market place development for tour and travel, providing a platform for vendors and customers to connect and transact in the tourism industry.",
    "Server setup and maintenance, ensuring the reliable and secure operation of web applications through efficient server configuration and ongoing maintenance.",
    "Creation of API documentation on Postman, providing a clear and comprehensive reference for developers and users to interact with web APIs.",
    "Application development for point redemption, allowing users to redeem points or rewards for various goods and services, encouraging user engagement and loyalty."
  ],
  "timeline": [
    {
      "title": "January 2019",
      "content": "Gatering information about system concept, Designing server architecture, Learn how microservice works"
    },
    {
      "title": "Februari 2019",
      "content": "Designing database architecture with microservice, Implement UI/UX for dashboard"
    },
    {
      "title": "March 2019",
      "content": "Built API contract for frontend and mobile apps, Connecting frontend dashboard with API"
    },
    {
      "title": "April 2019",
      "content": "Create Core business API, Integrate to citytours.sg API, Integrate to payment system Midtrans"
    },
    {
      "title": "May 2019",
      "content": "Testing app and UAT, fix several bug, Production Deployment, Publishing for phase 1"
    },
    {
      "title": "June 2019",
      "content": "Create new feature, Bug fix from previous application, Optimize database query"
    },
    {
      "title": "July 2019",
      "content": "Optimize microservice flow, Optimize code for readable"
    },
    {
      "title": "August 2019",
      "content": "Create new feature such as payment with poin, Updating rules on Citytours.sg integration"
    },
    {
      "title": "September 2019",
      "content": "Create campign feature and campign redemption"
    },
    {
      "title": "October 2019",
      "content": "Flow Testing, Bug fix, UAT"
    },
    {
      "title": "November 2019",
      "content": "Project finished"
    }
  ],
  "stacks": [
    {
      "type": "LARAVEL",
      "percentage": "70"
    },
    {
      "type": "BOOTSTRAP",
      "percentage": "10"
    },
    {
      "type": "JQUERY",
      "percentage": "20"
    },
    {
      "type": "MARIADB",
      "percentage": "100"
    },
    {
      "type": "NGINX",
      "percentage": "100"
    }
  ]
}