{
  "name": "Sepaket",
  "description": {
    "work": [
      "Sepaket is platform for parcel service for public integrated with JNE, JNT, SICEPAT, NINJA, and SAPX Courier",
      "The system that I built is Rest API, Sepaket have core system Send Parcel, Check Shipping Cost, Parcel Tracking"
    ],
    "about": [
      "Sepaket is a technology company engaged in the aggregator of shipping documents/goods throughout Indonesia.",
      "We prioritize easy and fast use so that customers have no difficulty in operating it."
    ]
  },
  "objective": [
    "Developed applications using Node.js and Express, utilizing the lightweight and efficient nature of Node.js for scalable and high-performance back-end solutions.",
    "Worked with PostgreSQL as the preferred database management system, ensuring secure and reliable data storage and retrieval.",
    "Utilized Docker containers to create portable and isolated environments, enabling seamless deployment and scalability.",
    "Implemented Redis cache for optimizing performance and improving response times, enhancing the overall efficiency of the applications.",
    "Integrated with JNE expedition, Sicepat expedition, Ninja expedition, and IDexpress expedition, enabling seamless integration and tracking of shipments.",
    "Integrated with Xendit for payment processing, providing secure and reliable payment solutions for users.",
    "Integrated with Google for authentication services, allowing users to log in and access the application using their Google accounts.",
    "Integrated with Sentry for error tracking and monitoring, facilitating efficient bug identification and resolution.",
    "Integrated with Telegram for real-time notifications and messaging, enhancing communication and collaboration within the application.",
    "Developed applications for the integration of third-party expeditions, streamlining shipment management and tracking processes.",
    "Conducted thorough testing and debugging to ensure the functionality, performance, and security of the applications.",
    "Collaborated closely with cross-functional teams to gather requirements, understand business needs, and deliver solutions that met the expectations.",
    "Followed best practices in software development, including version control, code documentation, and adherence to coding standards."
  ],
  "timeline": [
    {
      "title": "May 2022",
      "content": "Gathering requirements, Create an API contract"
    },
    {
      "title": "June 2022",
      "content": "Creating core API such as check shipping cost, scheduler for send request to Parcel System"
    },
    {
      "title": "July 2022",
      "content": "Integrate into parcel system"
    },
    {
      "title": "August 2022",
      "content": "Integrate with payment system (Xendit)"
    },
    {
      "title": "September 2022",
      "content": "UAT, Project Handover"
    }
  ],
  "stacks": [
    {
      "type": "NODEJS",
      "percentage": "80"
    },
    {
      "type": "DOCKER",
      "percentage": "20"
    },
    {
      "type": "POSTGRESQL",
      "percentage": "100"
    },
    {
      "type": "NGINX",
      "percentage": "100"
    }
  ]
}