{
  "name": "Stackbutler",
  "description": {
    "work": [
      "Stackbutler is Alternative software tools, Rating and review about software",
      "The system that I built is Restfull API, Database design, and Web frontend. Stackbutler have core system Managing review and Managing Software"
    ],
    "about": [
      "Stackbutler is an independent platform that provides information about software products.",
      "By analyzing various data points on the internet, we try to paint the best possible picture of a product."
    ]
  },
  "objective": [
    "Develop and implement microservices architecture to enhance scalability and flexibility.",
    "Utilize MariaDB as the database management system to ensure reliable data storage and retrieval.",
    "Incorporate Redis cache for optimized performance and efficient data caching.",
    "Leverage Laravel framework for streamlined development and robust application structure.",
    "Integrate big data processing techniques to handle large volumes of data effectively.",
    "Implement cookies for improved user experience and personalized features.",
    "Utilize native JavaScript and jQuery libraries for interactive and dynamic web development.",
    "Employ Bootstrap 3 framework for responsive and visually appealing web design.",
    "Work within an agile ecosystem to ensure iterative development, frequent feedback, and adaptability.",
    "Utilize GitHub for version control and collaborative development to enhance productivity and code management.",
    "Setup and maintain servers to ensure seamless deployment and smooth functioning of web applications.",
    "Create web designs from scratch, considering user experience and modern design principles.",
    "Integrate Gmail gateway as the email sender for seamless communication and efficient email delivery.",
    "Implement SEO optimization techniques to improve search engine visibility and increase organic traffic to the website."
  ],
  "timeline": [
    {
      "title": "April 2020",
      "content": "Meet about UI/UX, Stack Decision, Gathering Requirement"
    },
    {
      "title": "May 2020",
      "content": "Layouting frontend web, designing server, designing database"
    },
    {
      "title": "June 2020",
      "content": "Creating general API (product category, product type, etc)"
    },
    {
      "title": "July 2020",
      "content": "Creating Core API (product, review & rating, software suggestion)"
    },
    {
      "title": "August 2020",
      "content": "Connect API into web frontend, Publishing application (phase 1)"
    },
    {
      "title": "September 2020",
      "content": "Optimize database query, bug fixing"
    },
    {
      "title": "October 2020",
      "content": "Renew Design UI/UX, Renew flow"
    },
    {
      "title": "November 2020",
      "content": "Built new flow and API"
    },
    {
      "title": "December 2020",
      "content": "Integrate Gmail service as an email sender"
    },
    {
      "title": "January 2021",
      "content": "Integrate new change from API"
    },
    {
      "title": "February 2021",
      "content": "SEO Optimized"
    },
    {
      "title": "March 2021",
      "content": "SEO Optimized, Optimize big data in database, Optimize frontend load time"
    },
    {
      "title": "April 2021",
      "content": "UAT, Project documentation, Publishing application (last phase: phase 2)"
    },
    {
      "title": "May 2021",
      "content": "Handle feedback, bug fix, project close"
    }
  ],
  "stacks": [
    {
      "type": "LARAVEL",
      "percentage": "60"
    },
    {
      "type": "JQUERY",
      "percentage": "20"
    },
    {
      "type": "BOOTSTRAP",
      "percentage": "20"
    },
    {
      "type": "MARIADB",
      "percentage": "100"
    },
    {
      "type": "NGINX",
      "percentage": "100"
    }
  ]
}