{
    "name": "Aviana Sinar Abadi",
    "description": {
      "work": [
        "Developed Aviana Sales Dashboard",
        "The system that I built is Dashboard CMS for sales, Aviana Dashboard Sales have core system for managing product, product affiliate, and product payment"
      ],
      "about": []
    },
    "objective": [
      "Created layouts from scratch, demonstrating proficiency in designing user interfaces tailored to specific requirements.",
      "Integrated APIs to enable data retrieval and interaction with external services.",
      "Utilized Redux for efficient state management, ensuring consistent data flow and seamless user experiences.",
      "Developed applications using Next.js, leveraging its server-side rendering and optimized performance.",
      "Developed user interfaces using the Ant Design framework for CSS, creating visually appealing and responsive designs.",
      "Conducted thorough testing and debugging to ensure the functionality, performance, and usability of the applications.",
      "Collaborated closely with designers and other developers to ensure successful integration and delivery of cohesive solutions.",
      "Followed best practices in web development, including code organization, separation of concerns, and adherence to coding standards."
    ],
    "timeline": [
      {
        "title": "March 2023",
        "content": "Meet about project scoope, layout, and flow"
      },
      {
        "title": "March 2023",
        "content": "Layouting for several module and implement Ant Framework for CSS Framework"
      },
      {
        "title": "April 2023",
        "content": "Integrate Aviana Rest API"
      },
      {
        "title": "Mei 2023",
        "content": "UAT, Bug fix, Project Done"
      }
    ],
    "stacks": [
      {
        "type": "NEXTJS",
        "percentage": "75"
      },
      {
        "type": "REDUX",
        "percentage": "5"
      },
      {
        "type": "CSS",
        "percentage": "20"
      }
    ]
  }