{
  "name": "DBM 360",
  "description": {
    "work": [
      "DBM 360 is platform for marketing management in Telkom Indonesia",
      "The system that I built is Rest API, DBM 360 have core system Managing their product, Track trafic at CMS that integrate with Power my Analytic (PMA), and Create project"
    ],
    "about": []
  },
  "objective": [
    "Developed applications using the Laravel framework, leveraging its robust features and elegant syntax for efficient web development.",
    "Utilized PostgreSQL as the preferred database management system, ensuring secure and reliable data storage and retrieval.",
    "Deployed applications using Docker, creating portable and isolated environments for seamless deployment and scalability, with an NGINX server as the web server.",
    "Integrated with Power My Analytics (PMA), a third-party analytics platform, enabling seamless data integration and analysis.",
    "Implemented Redis cache for storing and retrieving authentication tokens, enhancing performance and improving user experience.",
    "Developed applications with a scalable architecture in Laravel, ensuring the ability to handle increased user loads and maintain performance.",
    "Documented APIs using Postman, providing clear and comprehensive documentation for developers and facilitating API consumption.",
    "Conducted thorough testing and debugging to ensure the functionality, security, and performance of the applications.",
    "Collaborated closely with cross-functional teams, including designers and front-end developers, to ensure seamless integration and deliver high-quality solutions.",
    "Followed best practices in software development, including version control, code documentation, and adherence to coding standards."
  ],
  "timeline": [
    {
      "title": "August 2022",
      "content": "Meeting about system requirements, Stack decision, Create an general API"
    },
    {
      "title": "September 2022",
      "content": "Setup server, create an API contract"
    },
    {
      "title": "October 2022",
      "content": "Creating core API, support API feedback from frontend"
    },
    {
      "title": "November 2022",
      "content": "Integrate with PMA (https://www.powermyanalytics.com)"
    },
    {
      "title": "December 2022",
      "content": "Bugfix and Optimize server build"
    },
    {
      "title": "January 2023",
      "content": "UAT, Project done"
    }
  ],
  "stacks": [
    {
      "type": "LARAVEL",
      "percentage": "90"
    },
    {
      "type": "DOCKER",
      "percentage": "10"
    },
    {
      "type": "POSTGRESQL",
      "percentage": "100"
    },
    {
      "type": "NGINX",
      "percentage": "100"
    }
  ]
}