{
    "name": "Pamapersada Nusantara",
    "description": {
      "work": [
        "Revamp and Optimize API and Query of Pamapersada Dashboard Operator",
        "The system that I built is Dashboard for Operator, Pamapersada have core system check operator absence, Sleep Monitoring of Operator, and Check Operator Anomaly Sleep."
      ],
      "about": []
    },
    "objective": [
      "Optimized codebase of an existing system, enhancing performance and reducing inefficiencies.",
      "Successfully migrated architecture to a microservices model, improving scalability and maintainability.",
      "Transformed the database to PostgreSQL, enhancing data integrity and optimizing queries.",
      "Improved query performance and reduced API load times, resulting in a smoother user experience.",
      "Developed applications using Laravel framework, leveraging its features for efficient web development.",
      "Utilized AWS services for cloud-based deployment, ensuring scalability, reliability, and security.",
      "Integrated Redis Cache for optimized data storage and retrieval, enhancing application speed and responsiveness.",
      "Utilized Bootstrap 5 for responsive and visually appealing user interfaces.",
      "Integrated Chart.js for data visualization, providing insightful graphical representations.",
      "Created comprehensive API documentation using Postman, facilitating seamless integration and interaction."
    ],
    "timeline": [
      {
        "title": "Mei 2023",
        "content": "Learn the existing flow and existing code"
      },
      {
        "title": "Mei 2023",
        "content": "Init Database Migration, Optimize query load time, Optimize code readablity"
      },
      {
        "title": "June 2023",
        "content": "Create API for mobile app, Testing"
      },
      {
        "title": "July 2023",
        "content": "Renew Dashboard layout with readable code"
      }
    ],
    "stacks": [
      {
        "type": "LARAVEL",
        "percentage": "70"
      },
      {
        "type": "POSTGRESQL",
        "percentage": "15"
      },
      {
        "type": "NGINX",
        "percentage": "5"
      },
      {
        "type": "BOOTSTRAP",
        "percentage": "5"
      },
      {
        "type": "DOCKER",
        "percentage": "5"
      }
    ]
  }