{
  "name": "Masjidku",
  "description": {
    "work": [
      "Masjidku is an application for find a mosque",
      "The system that I built is CMS (Content Management System) of Masjidku. Masjidku have CMS with core system Managing Mosque, Holy Verses, Donation and more"
    ],
    "about": [
      "Masjidku is an application developed specifically to meet the administrative and financial needs of mosques in Indonesia.",
      "Includes management information management, news and activity schedules, zakat calculations, congregation data, financial transactions, cash reports, to fundraising."
    ]
  },
  "objective": [
    "Development with Codeigniter 3, utilizing the framework to build robust and scalable web applications with clean code and efficient workflows.",
    "Development with MySQL, leveraging the database management system to build dynamic and responsive applications that effectively store and manage large amounts of data.",
    "Development with cookies and sessions, allowing for the management of user data and preferences in web applications.",
    "Server setup and maintenance, ensuring the reliable and secure operation of web applications through efficient server configuration and ongoing maintenance.",
    "Integration with Google Maps, allowing for enhanced location-based functionality and mapping capabilities in software applications.",
    "Integration with Firebase, allowing for real-time data synchronization, authentication, and other features to enhance the functionality and user experience of web and mobile applications.",
    "Application development for searching stations to refill water in Bali, utilizing location-based technology and intuitive user interfaces to help users quickly and easily locate water refill stations in Bali, promoting sustainable and eco-friendly water usage."
  ],
  "timeline": [
    {
      "title": "October 2018",
      "content": "Meet about system will build, Gathering requirements, Stack decision, Task Breakdown"
    },
    {
      "title": "October 2018",
      "content": "Syncronize with UI/UX, Layouting frontend CMS, Designing Flow system, Database, and server"
    },
    {
      "title": "November 2018",
      "content": "Create Mock API, Create Master data API such as product, category, and other"
    },
    {
      "title": "November 2018",
      "content": "Create Core business API, Integrate Google maps, Connect API to frontend mobile app and web"
    },
    {
      "title": "December 2018",
      "content": "Testing app and UAT, fix several bug, Production Deployment, Publishing"
    }
  ],
  "stacks": [
    {
      "type": "CODEIGNETER",
      "percentage": "60"
    },
    {
      "type": "PHP",
      "percentage": "5"
    },
    {
      "type": "BOOTSTRAP",
      "percentage": "15"
    },
    {
      "type": "JQUERY",
      "percentage": "20"
    },
    {
      "type": "MYSQL",
      "percentage": "100"
    },
    {
      "type": "NGINX",
      "percentage": "100"
    }
  ]
}